Merge branch 'feature/upgrade_tools' into develop
